{
  "header": {
    "hello": "Hallo, ",
    "name": "ich bin Dariusz",
    "profession": "Anfänger Webentwickler",
    "description": "Willkommen in meiner Ecke der digitalen Welt! Ich bin ein aufstrebender Webentwickler, befeuert von der Leidenschaft, fesselnde Online-Erlebnisse zu schaffen. Mit einer grafischen Design-Vergangenheit und einer neu entdeckten Liebe zum Codieren, bemühe ich mich, optisch ansprechende und funktionale Benutzeroberflächen zu gestalten, die einen bleibenden Eindruck hinterlassen. Ich bin gespannt auf die Zusammenarbeit und darauf, transformative Reisen anzutreten, um digitale Träume zum Leben zu erwecken. Lass uns zusammen Wunder erschaffen!"
  },
  "navbar": {
    "home": "Startseite",
    "about": "Über mich",
    "skills": "Fähigkeiten",
    "myWork": "Meine Arbeit",
    "resume": "Lebenslauf",
    "contact": "Kontakt"
  },
  "about": {
    "heading": "Willkommen in meiner digitalen Ecke!",
    "article": [
      {
        "paragraph": [
          "Erlauben Sie mir, mich vorzustellen — ich bin ein aufstrebender Webentwickler, angetrieben von einer ",
          {
            "strong": "unermüdlichen Leidenschaft"
          },
          " für die Schaffung fesselnder Online-Erlebnisse. Mein Weg war nicht gerade, aber voller Wendungen und Überraschungen, die mich letztendlich in die faszinierende Welt der Webentwicklung führten."
        ]
      },
      {
        "paragraph": [
          "Zu Beginn meiner Reise tauchte ich in die ",
          {
            "strong": "Kunst des Grafikdesigns"
          },
          " ein und besuchte eine Schule, die sich auf diese kreative Disziplin konzentrierte. Der Reiz des visuellen Geschichtenerzählens fesselte mich und inspirierte Träume, atemberaubende Visualisierungen zu schaffen, die das Publikum begeistern. Begierig darauf, meine künstlerischen Neigungen weiter zu erkunden, studierte ich während meiner College-Jahre Skulptur und Computergrafik. Doch wie das Schicksal es wollte, erkannte ich, dass diese Wege nicht meine wahre Berufung waren."
        ]
      },
      {
        "paragraph": [
          "In dieser introspektiven Phase stieß ich auf ",
          {
            "strong": "Webentwicklung"
          },
          " — eine magische Verschmelzung von Kunst und technischer Finesse. Fasziniert von der Macht, die digitale Landschaft zu gestalten, beschloss ich, meine Bemühungen in Richtung Webentwicklung zu lenken."
        ]
      },
      {
        "paragraph": [
          "Mit Eifer und Entschlossenheit begann ich eine Reihe intensiver Kurse und Online-Tutorials. Durch diese Lernerfahrungen verfeinerte ich meine Fähigkeiten in ",
          {
            "strong": "HTML"
          },
          " und ",
          {
            "strong": "CSS"
          },
          " und beherrschte die grundlegenden Elemente des Webdesigns. Aber mein Wissenshunger hörte hier nicht auf. Mit Begeisterung tauchte ich in die Welt von ",
          {
            "strong": "JavaScript"
          },
          " ein, fasziniert von seiner Vielseitigkeit und den endlosen Möglichkeiten, die es bot."
        ]
      },
      {
        "paragraph": [
          "Angetrieben von dem Wunsch, nahtlose und ansprechende Benutzererlebnisse zu schaffen, wagte ich mich in die Welt von ",
          {
            "strong": "React"
          },
          " und ",
          {
            "strong": "React Native"
          },
          ". Diese leistungsstarken Frameworks wurden zu meinen Verbündeten und ermöglichten es mir, meinen Visionen Leben einzuhauchen und sie sowohl auf Web- als auch auf Mobilplattformen zu verwirklichen."
        ]
      },
      {
        "paragraph": [
          "Als Webentwickler liegt meine Leidenschaft darin, ",
          {
            "strong": "funktionale und visuell ansprechende Schnittstellen"
          },
          " zu gestalten, die einen bleibenden Eindruck bei den Benutzern hinterlassen. Die Verbindung meines Hintergrunds im Grafikdesign mit meinem neu erworbenen technischen Können ermöglicht es mir, harmonische digitale Räume zu schaffen, die ",
          {
            "strong": "Ästhetik mit Benutzerfreundlichkeit"
          },
          " vereinen."
        ]
      },
      {
        "paragraph": [
          "Wenn Sie also einen ",
          {
            "strong": "entschlossenen und anpassungsfähigen"
          },
          " Webentwickler suchen, um Ihr Team zu verstärken, würde ich mich freuen, mit Ihnen zusammenzuarbeiten. Gemeinsam können wir eine transformative Reise antreten und außergewöhnliche digitale Erlebnisse schaffen, die einen bleibenden Eindruck in der virtuellen Landschaft hinterlassen."
        ]
      },
      {
        "paragraph": "Lassen Sie uns unsere digitalen Träume zum Leben erwecken!"
      }
    ]
  },
  "skills": {
    "heading": "Meine Fähigkeiten",
    "technologies": [
      {
        "category": "HTML",
        "sub": " (Hypertext Markup Language)",
        "list": [
          "Erstellen von semantisch korrekten Webseiten.",
          "Umgang mit verschiedenen Elementen wie Überschriften, Listen, Formularen und Multimedia.",
          "Verstehen der Bedeutung von Attributen und deren Auswirkungen auf die Seitenstruktur.",
          "Anwendung moderner HTML5-Standards, einschließlich Canvas- und Video-Elementen."
        ]
      },
      {
        "category": "CSS",
        "sub": " (Cascading Style Sheets)",
        "list": [
          "Entwerfen attraktiver und responsiver Benutzeroberflächen.",
          "Erstellen von Animationseffekten und Übergängen mit CSS3.",
          "Verwenden von CSS-Präprozessoren wie SASS für erhöhte Effizienz.",
          "Verstehen der Selektorspezifität und der kaskadierenden Natur von CSS-Stilen."
        ]
      },
      {
        "category": "SCSS",
        "sub": " (Sassy CSS)",
        "list": [
          "Verwenden von SCSS, um wartbaren und modularen CSS-Code zu schreiben.",
          "Nutzen von Variablen, Mixins und Verschachtelungen in SCSS.",
          "Kompilieren von SCSS zu Standard-CSS für Browserkompatibilität.",
          "Integration von SCSS in Frontend-Projekte für verbessertes Styling."
        ]
      },
      {
        "category": "TailwindCSS",
        "list": [
          "Effiziente Nutzung von Tailwind CSS für optimiertes Styling.",
          "Schreiben von prägnantem und auf Utilitys basierendem CSS mit Tailwind.",
          "Verwenden von Utility-Klassen zur Beschleunigung des Styling-Prozesses.",
          "Integration von Tailwind CSS in Frontend-Projekte für schnelle Entwicklung."
        ]
      },
      {
        "category": "Bootstrap",
        "list": [
          "Nutzung von Bootstrap für schnelles Design von responsiven Benutzeroberflächen.",
          "Verwenden von vorgefertigten Bootstrap-Komponenten und -Stilen für effizientes Prototyping.",
          "Anpassen von Bootstrap-Komponenten, um individuellen Projektanforderungen gerecht zu werden.",
          "Integration von Bootstrap in Frontend-Projekte zur Beschleunigung der Entwicklung."
        ]
      },
      {
        "category": "JavaScript",
        "list": [
          "Programmierung interaktiver Webanwendungen.",
          "Erkunden fortgeschrittener Bibliotheken und Frameworks wie React zur Verbesserung der Interaktivität von Webanwendungen.",
          "Asynchrone Programmierung mit Promises und async/await.",
          "Arbeiten mit ES6-Modulen und Verwalten von Abhängigkeiten."
        ]
      },
      {
        "category": "TypeScript",
        "list": [
          "Entwicklung typsicherer JavaScript-Anwendungen mit TypeScript.",
          "Erstellen und Verwenden von Schnittstellen, Typen und Generika in TypeScript.",
          "Transpilieren von TypeScript zu JavaScript für Browserkompatibilität.",
          "Integration von TypeScript in beliebte Frontend-Frameworks wie React."
        ]
      },
      {
        "category": "React",
        "list": [
          "Erstellen moderner Benutzeroberflächen mit der React-Bibliothek.",
          "Verwalten von Zustand mit React Hooks und Redux.",
          "Routing mit React Router.",
          "Integration mit externen APIs und Serverkommunikation."
        ]
      },
      {
        "category": "Next.js",
        "list": [
          "Erstellen leistungsfähiger und optimierter React-Anwendungen mit Next.js.",
          "Nutzung von serverseitigem Rendering (SSR) und statischer Seitenerstellung (SSG) für schnellere Seitenladezeiten.",
          "Implementieren reibungsloser Seitenübergänge und clientseitiger Navigation.",
          "Nahtlose Integration von Next.js mit React für ein einheitliches Entwicklungserlebnis."
        ]
      },
      {
        "category": "Firebase",
        "list": [
          "Nutzung von Firebase für skalierbare und Echtzeit-Datenbanklösungen.",
          "Implementierung von Benutzerauthentifizierung und -autorisierung mit Firebase Authentication.",
          "Integration von Firebase Cloud Firestore für effiziente Datenspeicherung und -abfrage.",
          "Nutzung von Firebase Hosting für das Bereitstellen und Hosten von Webanwendungen."
        ]
      },
      {
        "category": "PHP",
        "sub": "(Hypertext Preprocessor)",
        "list": [
          "Erstellen dynamischer Webseiten und Webanwendungen.",
          "Arbeiten mit Datenbanken, einschließlich MySQL.",
          "Sichern von Anwendungen gegen Angriffe wie SQL Injection und XSS."
        ]
      },
      {
        "category": "Node.js",
        "list": [
          "Erstellen von Servern und Backend-Anwendungen in der Node.js-Umgebung.",
          "Verwendung von Express.js zum Erstellen von RESTful APIs.",
          "Effizientes Verwalten von Ressourcen mit npm oder yarn."
        ]
      },
      {
        "category": "MongoDB",
        "list": [
          "Arbeiten mit NoSQL-Datenbanken wie MongoDB für skalierbare und flexible Datenspeicherung.",
          "Erstellen und Abfragen von MongoDB-Datenbanken und -Sammlungen.",
          "Verwendung von Mongoose ODM für Node.js zur Interaktion mit MongoDB.",
          "Entwerfen von schemalosen Datenstrukturen für verschiedene Anwendungen."
        ]
      },
      {
        "category": "MySQL",
        "list": [
          "Verwalten relationaler Datenbanken mit MySQL.",
          "Erstellen und Optimieren von Datenbankschemata und -abfragen.",
          "Integration von MySQL in Backend-Anwendungen zur Datenspeicherung und -abfrage.",
          "Implementierung von Datenbanksicherheit und Leistungstuning."
        ]
      },
      {
        "category": "Git, GitHub",
        "list": [
          "Versionskontrolle des Quellcodes mit Git.",
          "Erstellen und Zusammenführen von Branches.",
          "Lösen von Konflikten und Anwenden bewährter Methoden in der Zusammenarbeit.",
          "Erstellen und Verwalten von Repositories auf der GitHub-Plattform."
        ]
      },
      {
        "category": "Visual Studio Code",
        "list": [
          "Effiziente Nutzung von Visual Studio Code als Code-Editor.",
          "Installation und Konfiguration von Erweiterungen zur Steigerung der Produktivität.",
          "Anpassen von Tastenkombinationen und Einstellungen für eine personalisierte Codierungsumgebung.",
          "Nutzung der Debugging- und Versionskontrollfunktionen von VS Code."
        ]
      }
    ]
  },
  "contact": {
    "heading": "Kontakt",
    "form": {
      "yourName": "Dein Name",
      "yourEmail": "Deine E-Mail",
      "message": "Nachricht",
      "send": "Senden"
    }
  },
  "projects": {
    "placeholderText": "Projekt suchen...",
    "all": "Alles",
    "begiedzDeveloper": "Aktuelle Seite, auf der du dich befindest!",
    "Clouder": "Wettervorhersageanwendung. Wetter-API von openweathermap.",
    "Currency Calculator": "Mobile und Webanwendung. Währungskurs-API von weatherapi.com.",
    "PHP Notes": "CRUD-Anwendung in PHP.",
    "React Chat": "Chat-Anwendung mit Firebase und React.",
    "NodeJS Blog": "CRUD-Anwendung in NodeJS.",
    "Workout Buddy": "Fullstack MERN CRUD-Anwendung.",
    "Simple JS Stopwatch": "Stoppuhr in JavaScript geschrieben. Benutzeroberfläche von Apple inspiriert."
  },
  "footer": {
    "trademark": "© 2024 Dariusz Begiedza. Alle Rechte vorbehalten.",
    "react": "Hergestellt mit React. Die Bibliothek für Web- und native Benutzeroberflächen.",
    "i18next": "Verwendet i18next. Ein Internationalisierungs-Framework, geschrieben in und für JavaScript.",
    "contact": {
      "heading": "Kontakt",
      "phone": "Telefon: ",
      "discord": "Discord: ",
      "email": "E-Mail: "
    }
  }
}
