{
  "header":{
    "hello":"hello, ",
    "name":"I'm Dariusz",
    "profession":"Beginner Web Developer",
    "description":"Welcome to my corner of the digital world! I'm a budding web developer fueled by a passion for creating captivating online experiences. With a background in graphic design and a newfound love for coding, I strive to craft visually appealing and functional interfaces that leave a lasting impression. I'm eager to collaborate and embark on transformative journeys, bringing digital dreams to life. Let's create wonders together!"
  },
  "navbar":{
    "home":"Home",
    "about":"About",
    "skills":"Skills",
    "myWork":"My Work",
    "resume":"Resume",
    "contact":"Contact"
  },
  "about":{
    "heading":"Welcome to my corner of the digital realm!",
    "article":[
      {
        "paragraph": [
          "Allow me to introduce myself — a budding web developer fueled by a ",
          {
            "strong": "relentless passion"
          },
          " for creating captivating online experiences. While my journey may not follow a straight path, it has been an adventure filled with twists and turns, ultimately leading me to the fascinating world of web development."
        ]
      },
      {
        "paragraph": [
          "In the early days, I immersed myself in the ",
          {
            "strong": "art of graphic design"
          },
          ", attending a high school focused on this creative discipline. The allure of visual storytelling captivated me, inspiring dreams of crafting stunning visuals that would captivate audiences. Eager to explore my artistic inclinations further, I pursued studies in sculpture and computer graphics during my college years. However, as fate would have it, I realized that these paths weren't my true calling."
        ]
      },
      {
        "paragraph": [
          "It was during this introspective period that I stumbled upon ",
          {
            "strong": "web development"
          },
          "—an enchanting fusion of artistry and technical wizardry. Intrigued by the power to shape the digital landscape, I decided to redirect my efforts and delve into the realm of web development."
        ]
      },
      {
        "paragraph": [
          "With fervor and determination, I embarked on a series of immersive courses and online tutorials. Through these learning experiences, I honed my skills in ",
          {
            "strong": "HTML"
          },
          " and ",
          {
            "strong": "CSS"
          },
          ", embracing the foundational elements of web design. But my hunger for knowledge didn't stop there. I eagerly delved into the world of ",
          {
            "strong": "JavaScript"
          },
          ", captivated by its versatility and the endless possibilities it offered."
        ]
      },
      {
        "paragraph": [
          "Driven by a desire to create seamless and engaging user experiences, I ventured into the realm of ",
          {
            "strong": "React"
          },
          " and ",
          {
            "strong": "React Native"
          },
          ". These powerful frameworks became my allies, enabling me to breathe life into my visions and bring them to fruition on both web and mobile platforms."
        ]
      },
      {
        "paragraph": [
          "As a web developer, my passion lies in crafting ",
          {
            "strong": "functional and visually appealing interfaces"
          },
          " that leave a lasting impact on users. The fusion of my background in graphic design and newfound technical prowess allows me to create harmonious digital spaces that blend ",
          {
            "strong": "aesthetics with usability"
          },
          "."
        ]
      },
      {
        "paragraph": [
          "So, if you're seeking a ",
          {
            "strong": "determined and adaptable"
          },
          " web developer to join your team, I would be thrilled to collaborate. Together, we can embark on a transformative journey, creating extraordinary digital experiences that leave a mark on the virtual landscape."
        ]
      },
      {
        "paragraph": "Let's bring our digital dreams to life!"
      }
    ]
  },
  "skills":{
    "heading":"My skills",
    "technologies":[
      {
        "category": "HTML",
        "sub": " (Hypertext Markup Language)",
        "list": [
          "Creating semantically correct web pages.",
          "Handling various types of elements such as headers, lists, forms, and multimedia.",
          "Understanding the significance of attributes and their impact on page structure.",
          "Applying modern HTML5 standards, including canvas and video elements."
        ]
      },
      {
        "category": "CSS",
        "sub": " (Cascading Style Sheets)",
        "list": [
          "Designing attractive and responsive user interfaces.",
          "Creating animation effects and transitions using CSS3.",
          "Using CSS preprocessors such as SASS or LESS for increased efficiency.",
          "Understanding selector specificity and the cascading nature of CSS styles."
        ]
      },
      {
        "category": "SCSS",
        "sub":" (Sassy CSS)",
        "list": [
          "Using SCSS to write more maintainable and modular CSS code.",
          "Leveraging variables, mixins, and nesting in SCSS.",
          "Compiling SCSS to standard CSS for browser compatibility.",
          "Integrating SCSS into frontend projects for improved styling."
        ]
      },
      {
        "category": "JavaScript",
        "list": [
          "Programming interactive web applications.",
          "Utilizing libraries and frameworks like jQuery or Vue.js.",
          "Asynchronous programming using Promises and async/await.",
          "Working with ES6 modules and managing dependencies."
        ]
      },
      {
        "category": "TypeScript",
        "list": [
          "Developing type-safe JavaScript applications using TypeScript.",
          "Creating and using interfaces, types, and generics in TypeScript.",
          "Transpiling TypeScript to JavaScript for browser compatibility.",
          "Integrating TypeScript with popular frontend frameworks like React and Angular."
        ]
      },
      {
        "category": "React",
        "list": [
          "Building modern user interfaces using the React library.",
          "Managing state using React Hooks and Redux.",
          "Routing with React Router.",
          "Integrating with external APIs and server communication."
        ]
      },
      {
        "category": "PHP",
        "sub": "(Hypertext Preprocessor)",
        "list": [
          "Building dynamic web pages and web applications.",
          "Working with databases, including MySQL and PostgreSQL.",
          "Developing backends for e-commerce, content management, and other applications.",
          "Securing applications against attacks such as SQL Injection and XSS."
        ]
      },
      {
        "category": "Node.js",
        "list": [
          "Creating servers and backend applications in the Node.js environment.",
          "Using Express.js to build RESTful APIs.",
          "Working with WebSockets and real-time communication.",
          "Efficiently managing resources using npm or yarn."
        ]
      },
      {
        "category": "MongoDB",
        "list": [
          "Working with NoSQL databases like MongoDB for scalable and flexible data storage.",
          "Creating and querying MongoDB databases and collections.",
          "Using Mongoose ODM for Node.js to interact with MongoDB.",
          "Designing schema-less data structures for various applications."
        ]
      },
      {
        "category": "MySQL",
        "list": [
          "Managing relational databases using MySQL.",
          "Creating and optimizing database schemas and queries.",
          "Integrating MySQL with backend applications for data storage and retrieval.",
          "Implementing database security and performance tuning."
        ]
      },
      {
        "category": "Git, GitHub",
        "list": [
          "Version control of source code using Git.",
          "Branching and merging code.",
          "Resolving conflicts and applying best practices in collaborative work.",
          "Creating and managing repositories on the GitHub platform."
        ]
      },
      {
        "category": "Visual Studio Code",
        "list": [
          "Efficiently using Visual Studio Code as a code editor.",
          "Installing and configuring extensions for improved productivity.",
          "Customizing keybindings and settings for a personalized coding environment.",
          "Utilizing VS Code's debugging and version control features."
        ]
      }
    ]
  },
  "contact":{
    "heading":"Contact",
    "form":{
      "yourName":"Your name",
      "yourEmail":"Your E-mail",
      "message":"Message"
    }
  },
  "projects":{
    "Clouder":"API Weather App.",
    "PHP Notes":"CRUD PHP App.",
    "React Chat":"Chat app using SaaS Firebase + React.",
    "NodeJS Blog":"CRUD NodeJS App.",
    "Workout Buddy":"Fullstack MERN CRUD App.",
    "Simple JS Stopwatch":"Stopwatch made in JavaScript. UI inspired by Apple."
  }
}