{
  "header":{
    "hello": "hallo, ",
    "name": "Ik ben Dariusz",
    "profession": "Beginnende Webontwikkelaar",
    "description": "Welkom in mijn hoekje van de digitale wereld! Ik ben een beginnende webontwikkelaar, gedreven door een passie voor het creëren van boeiende online ervaringen. Met een achtergrond in grafisch ontwerp en een nieuw ontdekte liefde voor coderen, streef ik ernaar visueel aantrekkelijke en functionele interfaces te ontwerpen die een blijvende indruk achterlaten. Ik sta klaar om samen te werken en op transformerende reizen te gaan om digitale dromen tot leven te brengen. Laten we samen wonderen creëren!"
  },
  "navbar":{
    "home": "Thuis",
    "about": "Over",
    "skills": "Vaardigheden",
    "myWork": "Mijn Werk",
    "resume": "Curriculum Vitae",
    "contact": "Contact"
  },
  "about":{
    "heading":"Welkom in mijn hoek van het digitale rijk!",
    "article":[
      {
        "paragraph": [
          "Laat me mezelf voorstellen — een beginnende webontwikkelaar gedreven door een ",
          {
            "strong": "onvermoeibare passie"
          },
          " voor het creëren van boeiende online ervaringen. Hoewel mijn reis misschien niet rechtlijnig verloopt, is het een avontuur geweest vol wendingen en bochten, dat me uiteindelijk heeft geleid naar de fascinerende wereld van webontwikkeling."
        ]
      },
      {
        "paragraph": [
          "In de vroege dagen verdiepte ik me in de ",
          {
            "strong": "kunst van grafisch ontwerp"
          },
          " en volgde ik een middelbare school die zich richtte op deze creatieve discipline. De aantrekkingskracht van visuele verhalen boeide me, en inspireerde dromen over het maken van verbluffende visuals die het publiek zouden betoveren. Gedreven om mijn artistieke neigingen verder te verkennen, studeerde ik beeldhouwkunst en computergraphics tijdens mijn studententijd. Maar, zoals het lot het zou hebben, besefte ik dat deze paden niet mijn ware roeping waren."
        ]
      },
      {
        "paragraph": [
          "Het was tijdens deze introspectieve periode dat ik stuitte op ",
          {
            "strong": "webontwikkeling"
          },
          "—een betoverende samensmelting van artisticiteit en technische vaardigheid. Intrigerend door de kracht om het digitale landschap te vormgeven, besloot ik mijn inspanningen te heroriënteren en me te verdiepen in de wereld van webontwikkeling."
        ]
      },
      {
        "paragraph": [
          "Met vuur en vastberadenheid begon ik aan een reeks intensieve cursussen en online tutorials. Tijdens deze leerervaringen verfijnde ik mijn vaardigheden in ",
          {
            "strong": "HTML"
          },
          " en ",
          {
            "strong": "CSS"
          },
          ", waarbij ik de basisprincipes van webdesign omarmde. Maar mijn honger naar kennis hield daar niet op. Ik dook enthousiast in de wereld van ",
          {
            "strong": "JavaScript"
          },
          ", gefascineerd door zijn veelzijdigheid en de eindeloze mogelijkheden die het bood."
        ]
      },
      {
        "paragraph": [
          "Gedreven door de wens om naadloze en boeiende gebruikerservaringen te creëren, waagde ik me in de wereld van ",
          {
            "strong": "React"
          },
          " en ",
          {
            "strong": "React Native"
          },
          ". Deze krachtige frameworks werden mijn bondgenoten, waardoor ik leven kon blazen in mijn visies en ze kon verwezenlijken op zowel web- als mobiele platforms."
        ]
      },
      {
        "paragraph": [
          "Als webontwikkelaar ligt mijn passie in het creëren van ",
          {
            "strong": "functionele en visueel aantrekkelijke interfaces"
          },
          " die een blijvende indruk achterlaten bij gebruikers. De samensmelting van mijn achtergrond in grafisch ontwerp en mijn nieuwe technische vaardigheden stelt me in staat harmonieuze digitale ruimtes te creëren die ",
          {
            "strong": "esthetiek met gebruiksgemak"
          },
          " combineren."
        ]
      },
      {
        "paragraph": [
          "Dus, als u een ",
          {
            "strong": "vastberaden en aanpasbare"
          },
          " webontwikkelaar zoekt om zich bij uw team aan te sluiten, zou ik graag samenwerken. Samen kunnen we een transformerende reis beginnen en buitengewone digitale ervaringen creëren die een stempel drukken op het virtuele landschap."
        ]
      },
      {
        "paragraph": "Laten we onze digitale dromen tot leven brengen!"
      }
    ]
  },
  "skills": {
    "heading": "Mijn vaardigheden",
    "technologies": [
        {
          "category": "HTML",
          "sub": " (Hypertext Markup Language)",
          "list": [
              "Het creëren van semantisch correcte webpagina's.",
              "Omgaan met verschillende soorten elementen zoals koppen, lijsten, formulieren en multimedia.",
              "Begrip van de betekenis van attributen en hun invloed op de paginestructuur.",
              "Toepassing van moderne HTML5-standaarden, inclusief canvas- en video-elementen."
          ]
        },
        {
            "category": "CSS",
            "sub": " (Cascading Style Sheets)",
            "list": [
                "Het ontwerpen van aantrekkelijke en responsieve gebruikersinterfaces.",
                "Het creëren van animatie-effecten en overgangen met CSS3.",
                "Het gebruik van CSS-preprocessors zoals SASS of LESS voor een verhoogde efficiëntie.",
                "Begrip van de specificiteit van selectors en de cascade-aard van CSS-stijlen."
            ]
        },
        {
            "category": "SCSS",
            "sub": " (Sassy CSS)",
            "list": [
                "Het gebruik van SCSS om meer onderhoudsvriendelijke en modulaire CSS-code te schrijven.",
                "Het benutten van variabelen, mixins en nesten in SCSS.",
                "Het compileren van SCSS naar standaard CSS voor browsercompatibiliteit.",
                "Het integreren van SCSS in frontend-projecten voor verbeterde vormgeving."
            ]
        },
        {
            "category": "JavaScript",
            "list": [
                "Het programmeren van interactieve webtoepassingen.",
                "Het gebruik van bibliotheken en frameworks zoals jQuery of Vue.js.",
                "Asynchroon programmeren met Promises en async/await.",
                "Werken met ES6-modules en het beheren van afhankelijkheden."
            ]
        },
        {
            "category": "TypeScript",
            "list": [
                "Het ontwikkelen van typeveilige JavaScript-toepassingen met TypeScript.",
                "Het maken en gebruiken van interfaces, typen en generieke typen in TypeScript.",
                "Het transpileren van TypeScript naar JavaScript voor browsercompatibiliteit.",
                "Het integreren van TypeScript met populaire frontend-frameworks zoals React en Angular."
            ]
        },
        {
            "category": "React",
            "list": [
                "Het bouwen van moderne gebruikersinterfaces met de React-bibliotheek.",
                "Het beheren van de staat met behulp van React Hooks en Redux.",
                "Routeren met React Router.",
                "Het integreren met externe API's en servercommunicatie."
            ]
        },
        {
            "category": "PHP",
            "sub": "(Hypertext Preprocessor)",
            "list": [
                "Het bouwen van dynamische webpagina's en webtoepassingen.",
                "Werken met databases, waaronder MySQL en PostgreSQL.",
                "Het ontwikkelen van back-ends voor e-commerce, contentbeheer en andere toepassingen.",
                "Het beveiligen van toepassingen tegen aanvallen zoals SQL Injection en XSS."
            ]
        },
        {
            "category": "Node.js",
            "list": [
                "Het creëren van servers en backend-toepassingen in de Node.js-omgeving.",
                "Het gebruik van Express.js voor het bouwen van RESTful API's.",
                "Het werken met WebSockets en realtime communicatie.",
                "Efficiënt beheer van resources met npm of yarn."
            ]
        },
        {
            "category": "MongoDB",
            "list": [
                "Het werken met NoSQL-databases zoals MongoDB voor schaalbare en flexibele gegevensopslag.",
                "Het maken en bevragen van MongoDB-databases en -collecties.",
                "Het gebruik van Mongoose ODM voor Node.js om te communiceren met MongoDB.",
                "Het ontwerpen van schema-loze gegevensstructuren voor verschillende toepassingen."
            ]
        },
        {
            "category": "MySQL",
            "list": [
                "Het beheren van relationele databases met MySQL.",
                "Het maken en optimaliseren van databaseschema's en query's.",
                "Het integreren van MySQL met backend-toepassingen voor gegevensopslag en -opvraging.",
                "Het implementeren van databasebeveiliging en prestatieoptimalisatie."
            ]
        },
        {
            "category": "Git, GitHub",
            "list": [
                "Versiebeheer van broncode met Git.",
                "Branching en samenvoegen van code.",
                "Oplossen van conflicten en toepassen van best practices in samenwerking.",
                "Het maken en beheren van repositories op het GitHub-platform."
            ]
        },
        {
            "category": "Visual Studio Code",
            "list": [
                "Efficiënt gebruik van Visual Studio Code als code-editor.",
                "Installeren en configureren van extensies voor verbeterde productiviteit.",
                "Aanpassen van sneltoetsen en instellingen voor een gepersonaliseerde ontwikkelomgeving.",
                "Gebruik maken van de debugging- en versiebeheerfuncties van VS Code."
            ]
        }
    ]
  },
  "contact": {
    "heading": "Contact",
    "form": {
        "yourName": "Je naam",
        "yourEmail": "Je e-mailadres",
        "message": "Bericht"
    }
  },
    "projects": {
      "Clouder": "API Weer App.",
      "PHP Notes": "CRUD PHP App.",
      "React Chat": "Chat-app met Firebase en React.",
      "NodeJS Blog": "CRUD NodeJS App.",
      "Workout Buddy": "Fullstack MERN CRUD App.",
      "Simple JS Stopwatch": "Stopwatch gemaakt in JavaScript. UI geïnspireerd door Apple."
    },
      "footer": {
        "trademark": "© 2023 Dariusz Begiedza. Alle rechten voorbehouden.",
        "react": "Gemaakt met React. De bibliotheek voor web- en native gebruikersinterfaces.",
        "i18next": "Gebruikte i18next. Een internationaliseringsframework geschreven in en voor JavaScript.",
        "contact": {
          "heading": "Contact",
          "phone": "Telefoon: ",
          "discord": "Discord: ",
          "email": "E-mail: "
        }
      }
    }