{
  "header": {
    "hello": "hallo, ",
    "name": "Ik ben Dariusz",
    "profession": "Beginnende Webontwikkelaar",
    "description": "Welkom in mijn hoekje van de digitale wereld! Ik ben een beginnende webontwikkelaar, gedreven door een passie voor het creëren van boeiende online ervaringen. Met een achtergrond in grafisch ontwerp en een nieuw ontdekte liefde voor coderen, streef ik ernaar visueel aantrekkelijke en functionele interfaces te ontwerpen die een blijvende indruk achterlaten. Ik sta klaar om samen te werken en op transformerende reizen te gaan om digitale dromen tot leven te brengen. Laten we samen wonderen creëren!"
  },
  "navbar": {
    "home": "Thuis",
    "about": "Over",
    "skills": "Vaardigheden",
    "myWork": "Mijn Werk",
    "resume": "Curriculum Vitae",
    "contact": "Contact"
  },
  "about": {
    "heading": "Welkom in mijn digitale hoek!",
    "article": [
      {
        "paragraph": [
          "Laat me mezelf voorstellen — ik ben een opkomende webontwikkelaar, gedreven door een ",
          {
            "strong": "onophoudelijke passie"
          },
          " voor het creëren van boeiende online ervaringen. Mijn reis was niet rechtlijnig, maar vol wendingen en verrassingen die me uiteindelijk naar de fascinerende wereld van webontwikkeling leidden."
        ]
      },
      {
        "paragraph": [
          "In de beginperiode dook ik onder in de ",
          {
            "strong": "kunst van grafisch ontwerp"
          },
          ", terwijl ik een middelbare school bezocht die zich op deze creatieve discipline richtte. De aantrekkingskracht van visuele verhalen betoverde me en inspireerde dromen om verbluffende visuals te maken die het publiek zouden boeien. Graag mijn artistieke neigingen verder verkennend, studeerde ik beeldhouwkunst en computergrafiek tijdens mijn studiejaren. Echter, zoals het lot het wilde, besefte ik dat deze paden niet mijn ware roeping waren."
        ]
      },
      {
        "paragraph": [
          "Tijdens deze introspectieve periode kwam ik toevallig ",
          {
            "strong": "webontwikkeling"
          },
          " tegen — een magische fusie van artistieke en technische finesse. Geïntrigeerd door de kracht om het digitale landschap vorm te geven, besloot ik mijn inspanningen te richten op webontwikkeling."
        ]
      },
      {
        "paragraph": [
          "Met enthousiasme en vastberadenheid begon ik aan een reeks intensieve cursussen en online tutorials. Door deze leerervaringen verbeterde ik mijn vaardigheden in ",
          {
            "strong": "HTML"
          },
          " en ",
          {
            "strong": "CSS"
          },
          ", waarbij ik de fundamentele elementen van webdesign beheerste. Maar mijn honger naar kennis stopte daar niet. Ik dook gretig in de wereld van ",
          {
            "strong": "JavaScript"
          },
          ", gefascineerd door zijn veelzijdigheid en de eindeloze mogelijkheden die het bood."
        ]
      },
      {
        "paragraph": [
          "Gedreven door een verlangen om naadloze en boeiende gebruikerservaringen te creëren, waagde ik me in de wereld van ",
          {
            "strong": "React"
          },
          " en ",
          {
            "strong": "React Native"
          },
          ". Deze krachtige frameworks werden mijn bondgenoten, waardoor ik mijn visies tot leven kon brengen en ze kon realiseren op zowel web- als mobiele platforms."
        ]
      },
      {
        "paragraph": [
          "Als webontwikkelaar ligt mijn passie in het creëren van ",
          {
            "strong": "functionele en visueel aantrekkelijke interfaces"
          },
          " die een blijvende indruk op gebruikers achterlaten. De combinatie van mijn achtergrond in grafisch ontwerp en mijn nieuw verworven technische bekwaamheid stelt me in staat om harmonieuze digitale ruimtes te creëren die ",
          {
            "strong": "esthetiek met bruikbaarheid"
          },
          " combineren."
        ]
      },
      {
        "paragraph": [
          "Dus als je op zoek bent naar een ",
          {
            "strong": "vastberaden en aanpasbare"
          },
          " webontwikkelaar om je team te versterken, zou ik graag met je samenwerken. Samen kunnen we een transformatieve reis beginnen en buitengewone digitale ervaringen creëren die een blijvende indruk achterlaten in het virtuele landschap."
        ]
      },
      {
        "paragraph": "Laten we onze digitale dromen tot leven brengen!"
      }
    ]
  },
  "skills": {
    "heading": "Mijn vaardigheden",
    "technologies": [
      {
        "category": "HTML",
        "sub": " (Hypertext Markup Language)",
        "list": [
          "Het maken van semantisch correcte webpagina's.",
          "Omgaan met verschillende elementen zoals headers, lijsten, formulieren en multimedia.",
          "Het begrijpen van de betekenis van attributen en hun invloed op de pagina-indeling.",
          "Toepassen van moderne HTML5-standaarden, inclusief canvas- en video-elementen."
        ]
      },
      {
        "category": "CSS",
        "sub": " (Cascading Style Sheets)",
        "list": [
          "Het ontwerpen van aantrekkelijke en responsieve gebruikersinterfaces.",
          "Het creëren van animatie-effecten en overgangen met CSS3.",
          "Gebruik van CSS-preprocessors zoals SASS voor verhoogde efficiëntie.",
          "Het begrijpen van selector-specificiteit en de cascade-natuur van CSS-stijlen."
        ]
      },
      {
        "category": "SCSS",
        "sub": " (Sassy CSS)",
        "list": [
          "Gebruik van SCSS om beter onderhoudbare en modulaire CSS-code te schrijven.",
          "Gebruik van variabelen, mixins en nesting in SCSS.",
          "Compileren van SCSS naar standaard CSS voor browsercompatibiliteit.",
          "Integratie van SCSS in frontendprojecten voor verbeterde styling."
        ]
      },
      {
        "category": "TailwindCSS",
        "list": [
          "Efficiënt gebruik van Tailwind CSS voor gestroomlijnde styling.",
          "Schrijven van beknopte en utility-first CSS met Tailwind.",
          "Gebruik van utility classes om het stylingproces te versnellen.",
          "Integratie van Tailwind CSS in frontendprojecten voor snelle ontwikkeling."
        ]
      },
      {
        "category": "Bootstrap",
        "list": [
          "Gebruik van Bootstrap voor snel ontwerp van responsieve gebruikersinterfaces.",
          "Gebruik van voorgebouwde Bootstrap-componenten en -stijlen voor efficiënt prototyping.",
          "Aanpassen van Bootstrap-componenten om aan individuele projectvereisten te voldoen.",
          "Integratie van Bootstrap in frontendprojecten om de ontwikkelingssnelheid te verhogen."
        ]
      },
      {
        "category": "JavaScript",
        "list": [
          "Programmeren van interactieve webapplicaties.",
          "Verkennen van geavanceerde bibliotheken en frameworks, zoals React, om de interactiviteit van webapplicaties te verbeteren.",
          "Asynchrone programmering met Promises en async/await.",
          "Werken met ES6-modules en beheren van afhankelijkheden."
        ]
      },
      {
        "category": "TypeScript",
        "list": [
          "Ontwikkelen van type-veilige JavaScript-applicaties met TypeScript.",
          "Maken en gebruiken van interfaces, types en generieken in TypeScript.",
          "Transpileren van TypeScript naar JavaScript voor browsercompatibiliteit.",
          "Integratie van TypeScript met populaire frontend-frameworks zoals React."
        ]
      },
      {
        "category": "React",
        "list": [
          "Het bouwen van moderne gebruikersinterfaces met de React-bibliotheek.",
          "Beheren van state met React Hooks en Redux.",
          "Routeren met React Router.",
          "Integratie met externe API's en servercommunicatie."
        ]
      },
      {
        "category": "Next.js",
        "list": [
          "Het bouwen van performante en geoptimaliseerde React-applicaties met Next.js.",
          "Gebruik van server-side rendering (SSR) en static site generation (SSG) voor snellere paginaladingen.",
          "Implementeren van soepele paginovergangen en client-side navigatie.",
          "Naadloze integratie van Next.js met React voor een samenhangende ontwikkelingservaring."
        ]
      },
      {
        "category": "Firebase",
        "list": [
          "Gebruik van Firebase voor schaalbare en realtime databasoplossingen.",
          "Implementeren van gebruikersauthenticatie en -autorisatie met Firebase Authentication.",
          "Integratie van Firebase Cloud Firestore voor efficiënte gegevensopslag en -opvraging.",
          "Gebruik van Firebase Hosting voor het inzetten en hosten van webapplicaties."
        ]
      },
      {
        "category": "PHP",
        "sub": "(Hypertext Preprocessor)",
        "list": [
          "Het bouwen van dynamische webpagina's en webapplicaties.",
          "Werken met databases, inclusief MySQL.",
          "Beveiligen van applicaties tegen aanvallen zoals SQL Injection en XSS."
        ]
      },
      {
        "category": "Node.js",
        "list": [
          "Het creëren van servers en backendapplicaties in de Node.js-omgeving.",
          "Gebruik van Express.js om RESTful API's te bouwen.",
          "Efficiënt beheren van bronnen met npm of yarn."
        ]
      },
      {
        "category": "MongoDB",
        "list": [
          "Werken met NoSQL-databases zoals MongoDB voor schaalbare en flexibele gegevensopslag.",
          "Maken en opvragen van MongoDB-databases en -collecties.",
          "Gebruik van Mongoose ODM voor Node.js om te communiceren met MongoDB.",
          "Ontwerpen van schema-loze datastructuren voor verschillende toepassingen."
        ]
      },
      {
        "category": "MySQL",
        "list": [
          "Beheren van relationele databases met MySQL.",
          "Maken en optimaliseren van databaseschema's en -query's.",
          "Integratie van MySQL met backendapplicaties voor gegevensopslag en -opvraging.",
          "Implementeren van databasesecurity en prestatie-optimalisatie."
        ]
      },
      {
        "category": "Git, GitHub",
        "list": [
          "Versiebeheer van broncode met Git.",
          "Branching en mergen van code.",
          "Oplossen van conflicten en toepassen van best practices in samenwerking.",
          "Maken en beheren van repositories op het GitHub-platform."
        ]
      },
      {
        "category": "Visual Studio Code",
        "list": [
          "Efficiënt gebruik van Visual Studio Code als code-editor.",
          "Installeren en configureren van extensies voor verhoogde productiviteit.",
          "Aanpassen van sneltoetsen en instellingen voor een gepersonaliseerde coderingsomgeving.",
          "Gebruik van de debugging- en versiebeheerfuncties van VS Code."
        ]
      }
    ]
  },
  "contact": {
    "heading": "Contact",
    "form": {
      "yourName": "Je naam",
      "yourEmail": "Je e-mailadres",
      "message": "Bericht",
      "send": "Verzenden"
    }
  },
  "projects": {
    "placeholderText": "Project zoeken...",
    "all": "Alles",
    "begiedzDeveloper": "Huidige pagina waarop je je bevindt!",
    "Clouder": "Weervoorspellingsapplicatie. Weer-API van openweathermap.",
    "Currency Calculator": "Mobiele en webapplicatie. Valutakoersen-API van weatherapi.com.",
    "PHP Notes": "CRUD-applicatie in PHP.",
    "React Chat": "Chatapplicatie met Firebase en React.",
    "NodeJS Blog": "CRUD-applicatie in NodeJS.",
    "Workout Buddy": "Fullstack MERN CRUD-applicatie.",
    "Simple JS Stopwatch": "Stopwatch geschreven in JavaScript. Interface geïnspireerd door Apple."
  },
  "footer": {
    "trademark": "© 2024 Dariusz Begiedza. Alle rechten voorbehouden.",
    "react": "Gemaakt met React. De bibliotheek voor web- en native gebruikersinterfaces.",
    "i18next": "Gebruikte i18next. Een internationaliseringsframework geschreven in en voor JavaScript.",
    "contact": {
      "heading": "Contact",
      "phone": "Telefoon: ",
      "discord": "Discord: ",
      "email": "E-mail: "
    }
  }
}
