{
  "header": {
    "hello": "cześć, ",
    "name": "Jestem Dariusz",
    "profession": "Początkujący Programista Webowy",
    "description": "Witaj w moim zakątku cyfrowego świata! Jestem początkującym programistą webowym, napędzanym pasją do tworzenia fascynujących doświadczeń online. Dzięki doświadczeniu w projektowaniu graficznym i nowo odkrytej miłości do kodowania, staram się tworzyć wizualnie atrakcyjne i funkcjonalne interfejsy, które pozostawiają trwałe wrażenie. Jestem gotów do współpracy i wyruszenia w transformacyjne podróże, ożywiając cyfrowe marzenia. Twórzmy razem cuda!"
  },
  "navbar": {
    "home": "Strona główna",
    "about": "O mnie",
    "skills": "Umiejętności",
    "myWork": "Moje projekty",
    "resume": "CV",
    "contact": "Kontakt"
  },
  "about": {
    "heading": "Witaj w moim cyfrowym zakątku!",
    "article": [
      {
        "paragraph": [
          "Pozwól, że się przedstawię — jestem rozwijającym się web developerem, napędzanym ",
          {
            "strong": "nieustającą pasją"
          },
          " do tworzenia fascynujących doświadczeń online. Moja droga nie była prosta, ale pełna zwrotów i niespodzianek, które ostatecznie doprowadziły mnie do fascynującego świata web developmentu."
        ]
      },
      {
        "paragraph": [
          "Na początku mojej przygody zanurzyłem się w ",
          {
            "strong": "sztuce projektowania graficznego"
          },
          ", uczęszczając do liceum plastycznego skoncentrowanego na tej kreatywnej dyscyplinie. Urok wizualnego opowiadania historii mnie zafascynował, inspirując marzenia o tworzeniu oszałamiających wizualizacji, które zachwycają odbiorców. Chętny do dalszego eksplorowania moich artystycznych skłonności, studiowałem rzeźbę i grafikę komputerową w czasie studiów. Jednakże, jak to bywa, los miał dla mnie inne plany."
        ]
      },
      {
        "paragraph": [
          "W okresie refleksji natknąłem się na ",
          {
            "strong": "web development"
          },
          " — magiczne połączenie artyzmu i technicznej finezji. Zaintrygowany mocą kształtowania cyfrowego krajobrazu, postanowiłem skierować swoje wysiłki w stronę web developmentu."
        ]
      },
      {
        "paragraph": [
          "Z zapałem i determinacją rozpocząłem serię intensywnych kursów i tutoriali online. Dzięki tym doświadczeniom nauczyłem się ",
          {
            "strong": "HTML"
          },
          " i ",
          {
            "strong": "CSS"
          },
          ", opanowując podstawowe elementy web designu. Ale moje pragnienie wiedzy na tym się nie skończyło. Z entuzjazmem zanurzyłem się w świat ",
          {
            "strong": "JavaScript"
          },
          ", zafascynowany jego wszechstronnością i nieograniczonymi możliwościami, jakie oferuje."
        ]
      },
      {
        "paragraph": [
          "Napędzany pragnieniem tworzenia płynnych i angażujących doświadczeń użytkowników, wkroczyłem do świata ",
          {
            "strong": "React"
          },
          " i ",
          {
            "strong": "React Native"
          },
          ". Te potężne frameworki stały się moimi sprzymierzeńcami, pozwalając mi tchnąć życie w moje wizje i realizować je na platformach zarówno webowych, jak i mobilnych."
        ]
      },
      {
        "paragraph": [
          "Jako web developer, moja pasja polega na tworzeniu ",
          {
            "strong": "funkcjonalnych i wizualnie atrakcyjnych interfejsów"
          },
          ", które pozostawiają trwały ślad na użytkownikach. Połączenie mojego doświadczenia w projektowaniu graficznym i nowo nabytej wiedzy technicznej pozwala mi tworzyć harmonijne przestrzenie cyfrowe, które łączą ",
          {
            "strong": "estetykę z użytecznością"
          },
          "."
        ]
      },
      {
        "paragraph": [
          "Więc jeśli szukasz ",
          {
            "strong": "zdeterminowanego i elastycznego"
          },
          " web developera do swojego zespołu, byłbym zachwycony możliwością współpracy. Razem możemy wyruszyć w transformacyjną podróż, tworząc niezwykłe doświadczenia cyfrowe, które pozostawią ślad na wirtualnym krajobrazie."
        ]
      },
      {
        "paragraph": "Zrealizujmy razem nasze cyfrowe marzenia!"
      }
    ]
  },
  "skills": {
    "heading": "Moje umiejętności",
    "technologies": [
      {
        "category": "HTML",
        "sub": " (Hypertext Markup Language)",
        "list": [
          "Tworzenie semantycznie poprawnych stron internetowych.",
          "Obsługa różnych elementów takich jak nagłówki, listy, formularze i multimedia.",
          "Zrozumienie znaczenia atrybutów i ich wpływu na strukturę strony.",
          "Stosowanie nowoczesnych standardów HTML5, w tym elementów canvas i video."
        ]
      },
      {
        "category": "CSS",
        "sub": " (Cascading Style Sheets)",
        "list": [
          "Projektowanie atrakcyjnych i responsywnych interfejsów użytkownika.",
          "Tworzenie efektów animacji i przejść przy użyciu CSS3.",
          "Korzystanie z preprocesorów CSS, takich jak SASS, dla zwiększenia wydajności.",
          "Zrozumienie specyfiki selektorów i kaskadowej natury stylów CSS."
        ]
      },
      {
        "category": "SCSS",
        "sub": " (Sassy CSS)",
        "list": [
          "Korzystanie z SCSS w celu pisania bardziej zrównoważonego i modułowego kodu CSS.",
          "Wykorzystywanie zmiennych, mixinów i zagnieżdżeń w SCSS.",
          "Kompilowanie SCSS do standardowego CSS dla zgodności z przeglądarkami.",
          "Integracja SCSS w projekty frontendowe dla lepszego stylowania."
        ]
      },
      {
        "category": "TailwindCSS",
        "list": [
          "Efektywne korzystanie z Tailwind CSS dla usprawnionego stylowania.",
          "Pisanie zwięzłego i zorientowanego na użyteczność CSS z Tailwind.",
          "Wykorzystywanie klas użyteczności do przyspieszenia procesu stylowania.",
          "Integracja Tailwind CSS w projekty frontendowe dla szybkiego rozwoju."
        ]
      },
      {
        "category": "Bootstrap",
        "list": [
          "Wykorzystanie Bootstrap do szybkiego projektowania responsywnych interfejsów użytkownika.",
          "Używanie gotowych komponentów i stylów Bootstrap do efektywnego prototypowania.",
          "Dostosowywanie komponentów Bootstrap do indywidualnych wymagań projektu.",
          "Integracja Bootstrap w projekty frontendowe w celu przyspieszenia rozwoju."
        ]
      },
      {
        "category": "JavaScript",
        "list": [
          "Programowanie interaktywnych aplikacji internetowych.",
          "Eksploracja zaawansowanych bibliotek i frameworków, takich jak React, w celu zwiększenia interaktywności aplikacji internetowych.",
          "Programowanie asynchroniczne z użyciem Promises i async/await.",
          "Praca z modułami ES6 i zarządzanie zależnościami."
        ]
      },
      {
        "category": "TypeScript",
        "list": [
          "Tworzenie aplikacji JavaScript z typami bezpieczeństwa przy użyciu TypeScript.",
          "Tworzenie i używanie interfejsów, typów i generików w TypeScript.",
          "Transpilacja TypeScript do JavaScript w celu zgodności z przeglądarkami.",
          "Integracja TypeScript z popularnymi frameworkami frontendowymi, takimi jak React."
        ]
      },
      {
        "category": "React",
        "list": [
          "Budowanie nowoczesnych interfejsów użytkownika przy użyciu biblioteki React.",
          "Zarządzanie stanem przy użyciu hooków React i Redux.",
          "Routing za pomocą React Router.",
          "Integracja z zewnętrznymi API i komunikacja z serwerem."
        ]
      },
      {
        "category": "Next.js",
        "list": [
          "Budowanie wydajnych i zoptymalizowanych aplikacji React przy użyciu Next.js.",
          "Wykorzystanie renderowania po stronie serwera (SSR) i statycznego generowania stron (SSG) dla szybszego ładowania stron.",
          "Implementacja płynnych przejść między stronami i nawigacji po stronie klienta.",
          "Bezproblemowa integracja Next.js z React dla spójnego doświadczenia deweloperskiego."
        ]
      },
      {
        "category": "Firebase",
        "list": [
          "Wykorzystanie Firebase do skalowalnych i czasu rzeczywistego, rozwiązań baz danych.",
          "Implementacja uwierzytelniania i autoryzacji użytkowników za pomocą Firebase Authentication.",
          "Integracja Firebase Cloud Firestore do efektywnego przechowywania i pobierania danych.",
          "Wykorzystanie Firebase Hosting do wdrażania i hostowania aplikacji internetowych."
        ]
      },
      {
        "category": "PHP",
        "sub": "(Hypertext Preprocessor)",
        "list": [
          "Tworzenie dynamicznych stron internetowych i aplikacji internetowych.",
          "Praca z bazami danych, w tym MySQL.",
          "Zabezpieczanie aplikacji przed atakami takimi jak SQL Injection i XSS."
        ]
      },
      {
        "category": "Node.js",
        "list": [
          "Tworzenie serwerów i aplikacji backendowych w środowisku Node.js.",
          "Korzystanie z Express.js do tworzenia RESTful API.",
          "Efektywne zarządzanie zasobami za pomocą npm lub yarn."
        ]
      },
      {
        "category": "MongoDB",
        "list": [
          "Praca z bazami danych NoSQL, takimi jak MongoDB, dla skalowalnego i elastycznego przechowywania danych.",
          "Tworzenie i wyszukiwanie baz danych i kolekcji MongoDB.",
          "Wykorzystanie Mongoose ODM dla Node.js do interakcji z MongoDB.",
          "Projektowanie bezszkieletowych struktur danych dla różnych aplikacji."
        ]
      },
      {
        "category": "MySQL",
        "list": [
          "Zarządzanie relacyjnymi bazami danych za pomocą MySQL.",
          "Tworzenie i optymalizacja schematów baz danych i zapytań.",
          "Integracja MySQL z aplikacjami backendowymi w celu przechowywania i pobierania danych.",
          "Implementacja zabezpieczeń baz danych i optymalizacja wydajności."
        ]
      },
      {
        "category": "Git, GitHub",
        "list": [
          "Kontrola wersji kodu źródłowego za pomocą Git.",
          "Tworzenie i scalanie branchy.",
          "Rozwiązywanie konfliktów i stosowanie najlepszych praktyk w pracy zespołowej.",
          "Tworzenie i zarządzanie repozytoriami na platformie GitHub."
        ]
      },
      {
        "category": "Visual Studio Code",
        "list": [
          "Efektywne korzystanie z Visual Studio Code jako edytora kodu.",
          "Instalowanie i konfigurowanie rozszerzeń w celu zwiększenia wydajności.",
          "Dostosowywanie skrótów klawiaturowych i ustawień dla spersonalizowanego środowiska programistycznego.",
          "Korzystanie z funkcji debugowania i kontroli wersji w VS Code."
        ]
      }
    ]
  },
  "contact": {
    "heading": "Kontakt",
    "form": {
      "yourName": "Twoje imię",
      "yourEmail": "Twój adres e-mail",
      "message": "Wiadomość",
      "send": "Wyślij"
    }
  },
  "projects": {
    "placeholderText": "Szukaj projektu...",
    "all": "Wszystko",
    "begiedzDeveloper": "Aktualna strona, na której się znajdujesz!",
    "Clouder": "Aplikacja z prognozą pogody. API pogody z openweathermap.",
    "Currency Calculator": "Aplikacja mobilna i internetowa. API kursów walut z weatherapi.com.",
    "PHP Notes": "Aplikacja CRUD w PHP.",
    "React Chat": "Aplikacja czat z użyciem Firebase i React.",
    "NodeJS Blog": "Aplikacja CRUD w NodeJS.",
    "Workout Buddy": "Aplikacja Fullstack MERN CRUD.",
    "Simple JS Stopwatch": "Stoper napisany w JavaScript. Interfejs inspirowany przez Apple."
  },
  "footer": {
    "trademark": "© 2024 Dariusz Begiedza. Wszelkie prawa zastrzeżone.",
    "react": "Zrobione z wykorzystaniem React. Biblioteka do tworzenia interfejsów użytkownika webowych i natywnych.",
    "i18next": "Użyto i18next. Framework do międzynarodowych tłumaczeń napisany w JavaScript.",
    "contact": {
      "heading": "Kontakt",
      "phone": "Telefon: ",
      "discord": "Discord: ",
      "email": "E-mail: "
    }
  }
}
